# Напиши программу, которая:Задаёт переменные: player_level (число — текущий уровень игрока, например 5), player_score (число очков, например 1200) и has_key_item (булево значение — есть ли у игрока специальный предмет, True/False).
# Проверяет доступ в "секретную локацию" по следующим правилам:
# Если уровень 10 и выше — доступ разрешён сразу, вне зависимости от остального.
# Если уровень меньше 10, но очков больше 1000 И есть предмет — доступ тоже разрешён.
# Во всех остальных случаях — доступ запрещён, и нужно вывести, скольких очков не хватает до 1000 (если очков меньше 1000) или сообщение, что не хватает предмета (если очков достаточно, но предмета нет).
# Выводит понятное сообщение в консоль в каждом случае (например: "Доступ разрешён", "Доступ запрещён, не хватает 300 очков", "Доступ запрещён, нужен специальный предмет").
#
# Используй: переменные разных типов, арифметику (для расчёта нехватки очков), сравнения, логические операторы and/or, конструкцию if/elif/else.

player_level = 5
player_score = 1200
has_key_item = False

if player_level >= 10:
    print("Доступ разрешен")
elif player_score >= 1000 and has_key_item == True:
    print("Доступ разрешен2")
else:
    if player_score <= 1000 and has_key_item == False:
        print(f"Доступ запрещен, не хватает {1000-player_score} очков и специального предмета")
    elif player_score <= 1000:
        print(f"Доступ запрещен, не хватает {1000 - player_score} очков")
    elif has_key_item == False:
        print("Доступ запрещен, не хватает специального предмета")
